import { FunctionComponent } from "react";
import { Link } from "react-router-dom";
import { UserInfo } from "../App";

interface aboutProps {
    userInfo:UserInfo
}
 
const about: FunctionComponent<aboutProps> = ( {userInfo} ) => {
    return (
    <div className="container text-center">
    <div className="aboutStyle">
                <h5 className="display-1 text-center">הסיפור שלנו...</h5>
                <p className="container backGround col-md-6 p-5 d-flex text-center" style={{ fontSize: "1.4rem" }}>
                    {/* בית הוא ההמשך הישיר שלכם. הוא אוגר בתוכו את הזיכרונות, המחשבות, האהבות והתקוות שלכם וזה המקום אליו תמיד תרצו להגיע בסופו של יום ארוך. הריהוט שבו אמור לשקף זאת ולעורר בכם את כל התחושות הללו. לכן מזנון אינו רק מקום אחסון כי אם המקום שבו נשמרים המזכרות שלכם מהטיול האחרון בחו"ל, מדף המטבח איננו רק מקום להניח בו את כוסות היין אלא הפינה המשקפת את טעמכם האישי (תרתי משמע) והספה איננה רק מקום ישיבה כי אם המקום אליו תרצו להגיע בסוף היום ולהרגיש עטופים ובטוחים.
                */}
               
               
               במרקם השוקק של חיי העיר, שבו כל רחוב טומן בחובו סיפור, יש מפלט למי שמחפש לא רק ריהוט אלא סימפוניה יקרה של נוחות, סגנון וייחודיות. ברוכים הבאים לעיצוב הבית, גן עדן לאוהבי האסתטיקה הביתית.

הסיפור שלנו, המסע שלך

הבית דיזיין, השוכן בלב ירושלים ברחוב רחביה, נולד מתוך תשוקה משותפת להפוך בתים לבתים. הסיפור התחיל מרעיון פשוט - ליצור חלל שבו כל רהיט מספר סיפור וכל פריט עיצוב לוחש סיפור של אלגנטיות נצחית.

עיצוב הבית, שנוסד על  , התפתח ליותר מסתם אולם תצוגה; זה הפך להמנון לאמנות החיים היפים. כבר מההתחלה, המשימה שלנו הייתה להגדיר מחדש את המושג עיצוב הבית, המשלב אומנות, יצירתיות ונגיעה של קסם.

אלגנטיות אוצרת, סגנון על-זמני

היכנסו לעיצוב הבית, ואתם נכנסים לעולם שבו כל פריט נבחר בקפידה, כל פינה מעוצבת בקפידה. הקולקציה שלנו משקפת לא רק טרנדים אלא את מהות החיים עם הכוונה. מעיצובים עכשוויים המאמצים אורח חיים מודרני ועד קלאסיקות על-זמניות המהדהדות את קסם העבר, כל פריט הוא הצהרה - יצירת אמנות שמחכה למצוא את מקומה בביתכם.

**אמנות ש

בעיצוב הבית אנו חוגגים את אומנות האומנות. שיתופי הפעולה שלנו עם בעלי מלאכה מיומנים ומעצבים ידועים מביאים לכם רהיטים שמתעלים על פונקציונליות גרידא. כל שבץ, כל מפרק וכל הפרטים המורכבים הם עדות למחויבות שלנו לאיכות. אנו מאמינים כי נשמתו של בית טמונה ברהיטים, ושואפים לצקת אופי לכל פריט שאנו מציעים.

חוויית קנייה בהתאמה אישית

יותר מסתם חנות, עיצוב הבית הוא חוויה. הצוות הבקיא שלנו כאן כדי להדריך אתכם במסע שלכם ליצירת בית שמהדהד את האישיות שלכם. בין אם אתם מחפשים ספת הצהרה, מיטה נעימה או פריט המבטא המושלם, אנו מחויבים לעזור לכם למצוא אותו. הבית שלך הוא שלוחה שלך, ואנחנו כאן כדי להבטיח שהוא משקף את הסגנון והסיפור שלך.
                </p>
                {userInfo.email == false &&
                    <Link to="/register">לחץ כאן כדי להירשם / להתחבר לאתר</Link>
                }
            </div>
            </div>        
);
}

 
export default about;